# 4.4 Bethany Reed Answers

## 1. Import Libraries and Data
## 2. Find Missing Value
## 3. Rename columns in ords
## 4. Check Data Types and Change
## 5. Transpose df_depts
## 6. Turn df_deps_t2 into data dictionary
## 7. Basic Analysis questions

### 1. Import Libraries and Data

In [1]:
# Import Data

In [2]:
import pandas as pd
import numpy as np
import os

In [3]:
# Import orders.csv

In [5]:
path = r'/Users/bethanybreed/Documents/A Career Foundry/07-2022 Instacart Basket Analysis'

In [6]:
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'original data', 'orders.csv'), index_col = False)

In [7]:
df_ords.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [8]:
# Drop eval_set column as not needed

In [9]:
df_ords2 = df_ords.drop(columns = ['eval_set'])

In [10]:
df_ords2.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [11]:
# Import products.csv

In [12]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'original data', 'products.csv'), index_col = False)

In [13]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [15]:
# Import departments.csv

In [16]:
df_depts = pd.read_csv(os.path.join(path, '02 Data', 'original data', 'departments.csv'), index_col = False)

In [17]:
df_depts.head()

,department_id,1,2,3,4,5,6,7,8,9,...,12,13,14,15,16,17,18,19,20,21
0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,dry goods pasta,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

### 2. Find Missing Value

In [18]:
# Find Missing Value in ords2

In [19]:
df_ords['days_since_prior_order'].value_counts(dropna = False)

30.0    369323
7.0     320608
6.0     240013
4.0     221696
3.0     217005
5.0     214503
NaN     206209
2.0     193206
8.0     181717
1.0     145247
9.0     118188
14.0    100230
10.0     95186
13.0     83214
11.0     80970
12.0     76146
0.0      67755
15.0     66579
16.0     46941
21.0     45470
17.0     39245
20.0     38527
18.0     35881
19.0     34384
22.0     32012
28.0     26777
23.0     23885
27.0     22013
24.0     20712
25.0     19234
29.0     19191
26.0     19016
Name: days_since_prior_order, dtype: int64

In [20]:
# Missing value is 206209

### 3. Rename columns in ords

In [21]:
# Rename columns order_dow to order_day_of_week

In [22]:
df_ords2.rename(columns = {'order_dow' : 'orders_day_of_week'}, inplace = True)

In [28]:
df_ords2.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

### 4. Check Data Types and Change

In [29]:
# Checking data types

In [32]:
df_ords2.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [33]:
# change data type for order_id and user_id as they should be string

In [34]:
df_ords2['order_id']=df_ords2['order_id'].astype('str')

In [35]:
df_ords2['user_id']=df_ords2['user_id'].astype('str')

In [36]:
# Checking Data types for prods

In [37]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [38]:
#change prod type for product_id, aisle_id, and dept_id

In [41]:
df_prods['product_id']=df_prods['product_id'].astype('str')
df_prods['aisle_id']=df_prods['aisle_id'].astype('str')
df_prods['department_id']=df_prods['department_id'].astype('str')

### 5. Transpose df_depts

In [70]:
#checking df_depts as it is wide

In [71]:
df_depts.head()

,department_id,1,2,3,4,5,6,7,8,9,...,12,13,14,15,16,17,18,19,20,21
0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,dry goods pasta,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

### Transposing df_depts

In [72]:
# transpose df_depts into df_deps_t

In [73]:
df_deps_t = df_depts.T

In [74]:
df_deps_t.head()

                        0
department_id  department
1                  frozen
2                   other
3                  bakery
4                 produce

In [49]:
#Clean up df_deps_t to create index and new headers

In [75]:
df_deps_t.reset_index()

            index                0
0   department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

In [76]:
new_header = df_deps_t.iloc[0]

In [77]:
new_header

0    department
Name: department_id, dtype: object

In [78]:
df_deps_t2 = df_deps_t[1:]

In [79]:
df_deps_t2.columns = new_header

In [80]:
df_deps_t2.head()

department_id department
1                 frozen
2                  other
3                 bakery
4                produce
5                alcohol

In [81]:
#Check df_deps_t2 data type and fix if needed

In [83]:
df_deps_t2.describe()

department_id department
count                 21
unique                21
top               frozen
freq                   1

### 6. Turn df_deps_t2 into data dictionary

In [84]:
data_dict = df_deps_t2.to_dict('index')

In [85]:
data_dict

{'1': {'department': 'frozen'},
 '2': {'department': 'other'},
 '3': {'department': 'bakery'},
 '4': {'department': 'produce'},
 '5': {'department': 'alcohol'},
 '6': {'department': 'international'},
 '7': {'department': 'beverages'},
 '8': {'department': 'pets'},
 '9': {'department': 'dry goods pasta'},
 '10': {'department': 'bulk'},
 '11': {'department': 'personal care'},
 '12': {'department': 'meat seafood'},
 '13': {'department': 'pantry'},
 '14': {'department': 'breakfast'},
 '15': {'department': 'canned goods'},
 '16': {'department': 'dairy eggs'},
 '17': {'department': 'household'},
 '18': {'department': 'babies'},
 '19': {'department': 'snacks'},
 '20': {'department': 'deli'},
 '21': {'department': 'missing'}}

## 7. Baisc Analysis questions

# Above was lesson wrangling, below is new tasks, if done above, will state what in/out includes it

### 2. I changed order_id, user_id in ords and product_id and aisle_id and department_id in prods

In [86]:
# See steps 34 & 35 for df_ords2 changes, see step 41 for df_prods change

### 3. rename user_id from ords to customer_number

In [87]:
df_ords2.rename(columns = {'user_id' : 'customer_number'}, inplace=True)

### 4. Busiest Hour for Placing Orders

In [93]:
df_ords2['order_hour_of_day'].describe()

count    3.421083e+06
mean     1.345202e+01
std      4.226088e+00
min      0.000000e+00
25%      1.000000e+01
50%      1.300000e+01
75%      1.600000e+01
max      2.300000e+01
Name: order_hour_of_day, dtype: float64

In [94]:
#Mean is 1.345 so the first hour (hour and a half) of each day is the busiest

### 5. meaning behind value of 4 in department id

In [96]:
print(data_dict.get('4'))

{'department': 'produce'}

In [97]:
# Department 4 is produce

### 6. more information about breakfast sales. create subset of those items

In [99]:
# used data_dict above to determine breakfast was dept 14

In [115]:
df_breakfast = df_prods.loc[df_prods['department_id'] == '14']

In [116]:
df_breakfast.head()

,product_id,product_name,aisle_id,department_id,prices
27,28,Wheat Chex Cereal,121,14,10.1
33,34,NaN,121,14,12.2
67,68,"Pancake Mix, Buttermilk",130,14,13.7
89,90,Smorz Cereal,121,14,3.9
210,211,Gluten Free Organic Cereal Coconut Maple Vanilla,130,14,3.6

### 7. Data about customers throwing dinner parties - including alcohol, deli, beverages, and meat/seafood

In [108]:
# Using data dictionary departments needed are 5, 20, 7, 12

In [117]:
df_dinnerparty = df_prods.loc[df_prods['department_id'].isin(['5', '7', '12', '20'])]

In [118]:
df_dinnerparty.head()

,product_id,product_name,aisle_id,department_id,prices
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
6,7,Pure Coconut Water With Orange,98,7,4.4
9,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7,8.4
10,11,Peach Mango Juice,31,7,2.8
16,17,Rendered Duck Fat,35,12,17.1

### 8. Count of items in dinnerparty subset

In [120]:
df_dinnerparty.describe()

            prices
count  7650.000000
mean      9.012458
std       4.997438
min       1.000000
25%       5.000000
50%       8.800000
75%      12.400000
max      25.000000

In [121]:
# Count of rows is 7,650 for dinnerparty subset

### 9. extract info about user_id 1

In [124]:
# create a subset of data with user1
df_user1 = df_ords2.loc[df_ords2['customer_number'] == '1']

In [125]:
df_user1.head()

,order_id,customer_number,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

### 10. extract details about user1 subset to get stats on that customer

In [126]:
df_user1.describe()

,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,11.000000,11.000000,11.000000,10.000000
mean,6.000000,2.636364,10.090909,19.000000
std,3.316625,1.286291,3.477198,9.030811
min,1.000000,1.000000,7.000000,0.000000
25%,3.500000,1.500000,7.500000,14.250000
50%,6.000000,3.000000,8.000000,19.500000
75%,8.500000,4.000000,13.000000,26.250000
max,11.000000,4.000000,16.000000,30.000000

### 12 & 13 Export df_ords2 and df_deps_t2 into prepared data folder for project

In [127]:
df_ords2.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_wrangled.csv'))

In [129]:
df_deps_t2.to_csv(os.path.join(path, '02 Data','Prepared Data', 'departments_wrangled.csv'))